import random
from datetime import datetime

people = {'А. С. Пушкина': '06.06.1799', 'И.В.Грозного': '25.08.1533', 'Пётр 1': '09.06.1672',
          'Гвидо ван Россума': '31.01.1956', 'В.В. Путина': '07.10.1952', 'Джо Байдена': '20.10.1942',
          'И. Панфилова': '01.01.1893', 'А. Грибоедова': '15.01.1795', 'Ю. Гагарина': '09.03.1934',
          'Э. По': '19.01.1809'}

days = {1: 'Первое', 2: 'Второе', 3: 'Третье', 4: 'Четвертое', 5: 'Пятое', 6: 'Шестое', 7: 'Седьмое', 8: 'Восьмое',
        9: 'Девятое', 10: 'Десятое', 11: 'Одиннадцатое', 12: 'Двенадцатое', 13: 'Тринадцатое', 14: 'Четырнадцатое',
        15: 'Пятнадцатое', 16: 'Шестнадцатое', 17: 'Семнадцатое', 18: 'Восемнадцатое', 19: 'Девятнадцатое',
        20: 'Двадцатое',
        21: 'Двадцать первое', 22: 'Двадцать второе', 23: 'Двадцать третье', 24: 'Двадцать четвертое',
        25: 'Двадцать пятое', 26: 'Двадцать шестое',
        27: 'Двадцать  седьмое', 28: 'Двадцать восьмое', 29: 'Двадцать девятое', 30: 'Тридцатое', 31: 'Тридцать первое'}

months = {1: 'Января', 2: 'Февраля', 3: 'Марта', 4: 'Апреля', 5: 'Мая', 6: 'Июня', 7: 'Июля', 8: 'Августа',
          9: 'Сентября', 10: 'Октября', 11: 'Ноября', 12: 'Декабря'}

data = list(people.items())
result = random.sample(data, 5)  # Берем рандомно 5 пар фамилий и дат.
print(result)
start = True
while start:
    right, wrong = 0, 0
    for i in result:
        x = input(f'Введите год рождения {i[0]}:  ')  # Запрашиваем дату
        if x == i[1]:
           print('Ваш ответ верный!!!')
           right += 1
           continue
        else:
            wrong += 1
            a = datetime.strptime(i[1], "%d.%m.%Y").date()   # Переводим из строки в формат date
        for key in days.keys():
            if key == a.day:
                answer = ''.join(str(days.get(key)) + ' ')
                break
                print(answer)
        for keys in months.keys():
            if keys == a.month:
                answer1 = ''.join(str(months.get(keys)) + ' ' + str(a.year))
                break
        answer2 = answer + answer1              # Склеиваем ответ
        print(f'Верный ответ: {answer2} года')
    print(f'Правильных ответов {right}\n'
          f'Процент правильных ответов {(right*100)/len(result)}%\n'
          'Неправильных ответов {wrong}\n'
          f'Процент неправильных ответов {(wrong*100)/len(result)}%\n')
    question = input(f'Желаете сыграть еще? (да или нет):  ')
    if question == 'нет':
        start = False
