"""
МОДУЛЬ 3
Программа "Личный счет"
Описание работы программы:
Пользователь запускает программу у него на счету 0
Программа предлагает следующие варианты действий
1. пополнить счет
2. покупка
3. история покупок
4. выход

1. пополнение счета
при выборе этого пункта пользователю предлагается ввести сумму на сколько пополнить счет
после того как пользователь вводит сумму она добавляется к счету
снова попадаем в основное меню

2. покупка
при выборе этого пункта пользователю предлагается ввести сумму покупки
если она больше количества денег на счете, то сообщаем что денег не хватает и переходим в основное меню
если денег достаточно предлагаем пользователю ввести название покупки, например (еда)
снимаем деньги со счета
сохраняем покупку в историю
выходим в основное меню

3. история покупок
выводим историю покупок пользователя (название и сумму)
возвращаемся в основное меню

4. выход
выход из программы

При выполнении задания можно пользоваться любыми средствами

Для реализации основного меню можно использовать пример ниже или написать свой
"""

history_pay = {}
bank_account = 0.0
while True:
    print('1. пополнение счета')
    print('2. покупка')
    print('3. история покупок')
    print('4. выход')

    choice = input('Выберите пункт меню ')
    if choice == '1':
        cash = float(input('Введите сумму для пополнения счета: '))
        bank_account += cash
        print(f'На вашем счете {bank_account} p.')
        continue
    elif choice == '2':
        pay = float(input('Введите сумму для покупки: '))
        if pay > bank_account:
            print('На счете не достаточно средств!')
            continue
        else:
            bank_account -= pay
            shop = input('Введите название покупки:  ')
            history_pay[shop] = pay
            print(history_pay)
            continue
    elif choice == '3':
        if len(history_pay) == 0:
            print('Вы не совершали покупок!')
        else:
            for k, v in history_pay.items():
                print(f'Ваши покупки: {k}, {v}')
    elif choice == '4':
        break
    else:
        print('Неверный пункт меню')
